examples/soap_defaults.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
	xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://www.oasis-open.org/committees/ebxml-msg/schema/envelope.xsd">
	<soap-env:Header>
		<eb:MessageHeader soap-env:mustUnderstand="1"
			eb:version="2.0">
			<eb:From>
				<eb:PartyId eb:type="zz">FROMPARTYID</eb:PartyId>
			</eb:From>
			<eb:To>
				<eb:PartyId eb:type="zz">TOPARTYID</eb:PartyId>
			</eb:To>
			<eb:CPAId>TOPARTYID.FROMPARTYID</eb:CPAId>
			<eb:ConversationId>EPOCH</eb:ConversationId>
			<eb:Service eb:type="string">SERVICE</eb:Service>
			<eb:Action>ACTION</eb:Action>
			<eb:MessageData>
				<eb:MessageId>EPOCHMINUS@ORGNAME.messaging.com</eb:MessageId>
				<eb:Timestamp>ENTRYDATE</eb:Timestamp>
			</eb:MessageData>
		</eb:MessageHeader>
		<eb:AckRequested soap-env:actor="urn:oasis:names:tc:ebxml-msg:actor:toPartyMSH"
			soap-env:mustUnderstand="1" eb:signed="false" eb:version="2.0"></eb:AckRequested>
	</soap-env:Header>
	<soap-env:Body>
		<eb:Manifest eb:version="2.0">
			<eb:Reference xlink:href="cid:EPOCHSHORT_EPOCHPLUS@ORGNAME.messaging.com"
				xlink:type="simple"></eb:Reference>
			<MetaData xmlns="http://www.cdc.gov/manifest/databaseinfo"
				soap-env:mustUnderstand="0">
				<DatabaseInfo soap-env:mustUnderstand="0">
					<RecordId soap-env:mustUnderstand="0">oracle.default.EPOCHSHORT</RecordId>
					<MessageId>EPOCHPLUS</MessageId>
					<Arguments></Arguments>
					<MessageRecipient></MessageRecipient>
				</DatabaseInfo>
			</MetaData>
			<ResponseChunking xmlns="http://www.cdc.gov/manifest/responsechunking"
				soap-env:mustUnderstand="0"></ResponseChunking>
			<PeerVersion xmlns="http://www.cdc.gov/manifest/databaseinfo">PHINEAS 0.1</PeerVersion>
		</eb:Manifest>
	</soap-env:Body>
</soap-env:Envelope>
